Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/extending.tmx
Source language: en
Languages: pl

source: #ifndef Py_SPAMMODULE_H #define Py_SPAMMODULE_H #ifdef __cplusplus extern "C" { #endif /* Header file for spammodule */ /* C API functions */ #define PySpam_System_NUM 0 #define PySpam_System_RETURN int #define PySpam_System_PROTO (const char *command) /* Total number of C API pointers */ #define PySpam_API_pointers 1 #ifdef SPAM_MODULE /* This section is used when compiling spammodule.c */ static PySpam_System_RETURN PySpam_System PySpam_System_PROTO; #else /* This section is used in modules that use spammodule's API */ static void **PySpam_API; #define PySpam_System \ (*(PySpam_System_RETURN (*)PySpam_System_PROTO) PySpam_API[PySpam_System_NUM]) /* Return -1 on error, 0 on success. * PyCapsule_Import will set an exception if there's an error. */ static int import_spam(void) { PySpam_API = (void **)PyCapsule_Import("spam._C_API", 0); return (PySpam_API != NULL) ? 0 : -1; } #endif #ifdef __cplusplus } #endif #endif /* !defined(Py_SPAMMODULE_H) */
pl: #ifndef Py_SPAMMODULE_H #define Py_SPAMMODULE_H #ifdef __cplusplus extern "C" { #endif /* Plik nagłówkowy dla spammodule */ /* Zadania sprzęgu programowania aplikacji w języku C (API) */ #define PySpam_System_NUM 0 #define PySpam_System_RETURN int #define PySpam_System_PROTO (const char *command) /* Całkowita liczba wskaźników C API */ #define PySpam_API_pointers 1 #ifdef SPAM_MODULE /* Ten rozdział jest używany gdy spammodule.c jest kompilowany*/ static PySpam_System_RETURN PySpam_System PySpam_System_PROTO; #else /* Ten rozdział jest używany w modułach które używają API spammodule*/ static void **PySpam_API; #define PySpam_System \ (*(PySpam_System_RETURN (*)PySpam_System_PROTO) PySpam_API[PySpam_System_NUM]) /* Zwróć -1 przy błędzie, 0 jako udane działanie. * PyCapsule_Import ustawi wyjątek jeśli zajdzie błąd. */ static int import_spam(void) { PySpam_API = (void **)PyCapsule_Import("spam._C_API", 0); return (PySpam_API != NULL) ? 0 : -1; } #endif #ifdef __cplusplus } #endif #endif /* !defined(Py_SPAMMODULE_H) */

source: All that a client module must do in order to have access to the function :cfunc:`PySpam_System` is to call the function (or rather macro) :cfunc:`import_spam` in its initialization function::
pl: Wszystkim co moduł klienta musi zrobić aby mieć dostęp do zadania :cfunc:`PySpam_System` jest wezwanie zadania (lub raczej makropolecenia) :cfunc:`import_spam` w jej zadaniu inicjującym::

source: PyMODINIT_FUNC PyInit_client(void) { PyObject *m; m = PyModule_Create(&clientmodule); if (m == NULL) return NULL; if (import_spam() < 0) return NULL; /* additional initialization can happen here */ return m; }
pl: PyMODINIT_FUNC PyInit_client(void) { PyObject *m; m = PyModule_Create(&clientmodule); if (m == NULL) return NULL; if (import_spam() < 0) return NULL; /* dodatkowe zainicjowanie może mieć miejsce tutaj */ return m; }

source: The main disadvantage of this approach is that the file :file:`spammodule.h` is rather complicated. However, the basic structure is the same for each function that is exported, so it has to be learned only once.
pl: Główną wadą tego podejścia jest to, że plik :file:`spammodule.h` jest raczej skomplikowany. Jednakże podstawowa struktura jest taka sama dla każdego zadania które jest wystawiane na zewnątrz więc trzeba się tego uczyć tylko raz.

source: Finally it should be mentioned that Capsules offer additional functionality, which is especially useful for memory allocation and deallocation of the pointer stored in a Capsule. The details are described in the Python/C API Reference Manual in the section :ref:`capsules` and in the implementation of Capsules (files :file:`Include/pycapsule.h` and :file:`Objects/pycapsule.c` in the Python source code distribution).
pl: Ostatecznie warto wspomnieć że kapsuły dają dodatkowe możliwości działania, które są szczególnie użyteczne dla umieszczania i zabierania miejsca w pamięci wskaźników zachowywanych w kapsule. Szczegóły są opisane w podręczniku użytkownika sprzęgu języków C i pytonowskiego w rozdziale :ref:`kapsuły` - z ang. - :ref:`capsules` i w wypełnieniu programowym kapsuł (plików :file:`Include/pycapsule.h` i :file:`Objects/pycapsule.c` w dystrybucji źródłowej kodu języka pytonowskiego).

source: Footnotes
pl: Przypisy dolne

source: An interface for this function already exists in the standard module :mod:`os` --- it was chosen as a simple and straightforward example.
pl: sprzęg dla tego zadania już istnieje w standardowym module :mod:`os` --- został on wybrany jako prosty i przejrzysty przykład.

source: The metaphor of "borrowing" a reference is not completely correct: the owner still has a copy of the reference.
pl: Metafora "pożyczania" odniesienia nie jest do końca poprawna: właściciel wciąż ma kopię odniesienia.

source: Checking that the reference count is at least 1 **does not work** --- the reference count itself could be in freed memory and may thus be reused for another object!
pl: Sprawdzanie że liczba odniesień jest przynajmniej 1 **nie działa** --- liczba odniesień sama w sobie może być w uwolnionej pamięci i dlatego może być ponownie użyta dla innego przedmiotu!

source: These guarantees don't hold when you use the "old" style calling convention --- this is still found in much existing code.
pl: Te gwarancje nie są w mocy gdy używasz "starego" sposobu wywoływania --- to jest wciąż znajdowane w dużej części istniejącego kodu.

source: Extending and Embedding the Python Interpreter
pl: Rozszerzanie i Załączanie programu interpretującego polecenia języka pytonowskiego.

source: Release
pl: Wydanie

source: |version|
pl: |wersja|

source: Date
pl: Data

source: |today|
pl: |dziś|

source: This document describes how to write modules in C or C++ to extend the Python interpreter with new modules. Those modules can define new functions but also new object types and their methods. The document also describes how to embed the Python interpreter in another application, for use as an extension language. Finally, it shows how to compile and link extension modules so that they can be loaded dynamically (at run time) into the interpreter, if the underlying operating system supports this feature.
pl: Ten dokument opisuje jak pisać moduły w C lub C++ aby rozszerzać program interpretujący polecenia języka pytonowskiego nowymi modułami. Te moduły mogą określać nowe zadania, ale także nowe rodzaje przedmiotów i ich sposoby postępowania. Dokument także opisuje jak załączać program interpretujący polecenia języka pytonowskiego w innej aplikacji, dla użycia jako rozszerzający język. Ostatecznie pokazuje jak kompilować i łączyć rozszerzające moduły tak żeby mogły być ładowane dynamicznie (w czasie wykonania) do programu interpretującego polecenia języka pytonowskiego, jeśli leżący u podstaw system operacyjny wspiera tą możliwość.

source: This document assumes basic knowledge about Python. For an informal introduction to the language, see :ref:`tutorial-index`. :ref:`reference-index` gives a more formal definition of the language. :ref:`library-index` documents the existing object types, functions and modules (both built-in and written in Python) that give the language its wide application range.
pl: Ten dokument przyjmuje założenie że znane są podstawy wiedzy o języku pytonowskim. Dla nieformalnego wprowadzenia do języka, zobacz :ref:`tutorial-index`. :ref:`reference-index` daje bardziej formalną definicję języka. :ref:`library-index` dokumentuje istniejące typy przedmiotów, zadań i modułów (zarówno wbudowanych jak i napisanych w języku pytonowskim) które dają językowi jego szeroki zakres zastosowań.

source: For a detailed description of the whole Python/C API, see the separate :ref:`c-api-index`.
pl: Dla szczegółowego opisu całego sprzęgu pomiędzy językami C i pytonowskim, zobacz oddzielny :ref:`c-api-index`.

source: Defining New Types
pl: Definiowanie nowych typów

source: As mentioned in the last chapter, Python allows the writer of an extension module to define new types that can be manipulated from Python code, much like strings and lists in core Python.
pl: Jak wspomniano w poprzednim rozdziale, język pytonowski pozwala piszącemu moduły rozszerzające definiować nowe typy które mogą być zmieniane z kodu w języku pytonowskim, tak jak ciągi i listy wewnątrz języka pytonowskiego.

source: This is not hard; the code for all extension types follows a pattern, but there are some details that you need to understand before you can get started.
pl: To nie jest trudne; kod dla wszystkich rodzajów rozszerzeń podąża za wzorcem, ale są pewne szczegóły, które musisz zrozumieć zanim będziesz mógł zacząć.

source: The Basics
pl: Podstawy

source: The Python runtime sees all Python objects as variables of type :ctype:`PyObject\*`. A :ctype:`PyObject` is not a very magnificent object - it just contains the refcount and a pointer to the object's "type object". This is where the action is; the type object determines which (C) functions get called when, for instance, an attribute gets looked up on an object or it is multiplied by another object. These C functions are called "type methods" to distinguish them from things like ``[].append`` (which we call "object methods").
pl: Wykonujący się program języka pytonowskiego widzi wszystkie przedmioty języka pytonowskiego jak zmienne typu :ctype:`PyObject\*`. :ctype:`PyObject` nie jest zbyt wspaniałym przedmiotem - zawiera on po prostu liczbę odniesień i wskaźnik do "typu przedmiotu" przedmiotu. To jest miejsce gdzie coś się dzieje; rodzaj przedmiotu określa które zadania (języka C) są wywoływane kiedy, dla przykładu, atrybut będzie podejrzany na przedmiocie lub będzie pomnożony przez inny przedmiot. Te zadania języka C są nazywane "sposobami postępowania właściwymi dla typu" aby odróżnić je od rzeczy takich jak ``[].append`` (które nazywamy "sposobami postępowania przedmiotów").

source: So, if you want to define a new object type, you need to create a new type object.
pl: Więc, jeśli chcesz określić nowy typ przedmiotu musisz stworzyć nowy przedmiot typu.

source: This sort of thing can only be explained by example, so here's a minimal, but complete, module that defines a new type:
pl: Tego rodzaju rzeczy można tylko wyjaśnić na przykładzie, więc tutaj jest minimalny, ale kompletny, moduł który definiuje nowy typ:

source: #include <Python.h> typedef struct { PyObject_HEAD /* Type-specific fields go here. */ } noddy_NoddyObject; static PyTypeObject noddy_NoddyType = { PyVarObject_HEAD_INIT(NULL, 0) "noddy.Noddy", /* tp_name */ sizeof(noddy_NoddyObject), /* tp_basicsize */ 0, /* tp_itemsize */ 0, /* tp_dealloc */ 0, /* tp_print */ 0, /* tp_getattr */ 0, /* tp_setattr */ 0, /* tp_reserved */ 0, /* tp_repr */ 0, /* tp_as_number */ 0, /* tp_as_sequence */ 0, /* tp_as_mapping */ 0, /* tp_hash */ 0, /* tp_call */ 0, /* tp_str */ 0, /* tp_getattro */ 0, /* tp_setattro */ 0, /* tp_as_buffer */ Py_TPFLAGS_DEFAULT, /* tp_flags */ "Noddy objects", /* tp_doc */ }; static PyModuleDef noddymodule = { PyModuleDef_HEAD_INIT, "noddy", "Example module that creates an extension type.", -1, NULL, NULL, NULL, NULL, NULL }; PyMODINIT_FUNC PyInit_noddy(void) { PyObject* m; noddy_NoddyType.tp_new = PyType_GenericNew; if (PyType_Ready(&noddy_NoddyType) < 0) return NULL; m = PyModule_Create(&noddymodule); if (m == NULL) return NULL; Py_INCREF(&noddy_NoddyType); PyModule_AddObject(m, "Noddy", (PyObject *)&noddy_NoddyType); return m; }
pl: #include <Python.h> typedef struct { PyObject_HEAD /* Szczególne-dla-typu pola idą tutaj. */ } noddy_NoddyObject; static PyTypeObject noddy_NoddyType = { PyVarObject_HEAD_INIT(NULL, 0) "noddy.Noddy", /* tp_name */ sizeof(noddy_NoddyObject), /* tp_basicsize */ 0, /* tp_itemsize */ 0, /* tp_dealloc */ 0, /* tp_print */ 0, /* tp_getattr */ 0, /* tp_setattr */ 0, /* tp_reserved */ 0, /* tp_repr */ 0, /* tp_as_number */ 0, /* tp_as_sequence */ 0, /* tp_as_mapping */ 0, /* tp_hash */ 0, /* tp_call */ 0, /* tp_str */ 0, /* tp_getattro */ 0, /* tp_setattro */ 0, /* tp_as_buffer */ Py_TPFLAGS_DEFAULT, /* tp_flags */ "Noddy objects", /* tp_doc */ }; static PyModuleDef noddymodule = { PyModuleDef_HEAD_INIT, "noddy", "Przykładowy moduł który tworzy typ rozszerzający.", -1, NULL, NULL, NULL, NULL, NULL }; PyMODINIT_FUNC PyInit_noddy(void) { PyObject* m; noddy_NoddyType.tp_new = PyType_GenericNew; if (PyType_Ready(&noddy_NoddyType) < 0) return NULL; m = PyModule_Create(&noddymodule); if (m == NULL) return NULL; Py_INCREF(&noddy_NoddyType); PyModule_AddObject(m, "Noddy", (PyObject *)&noddy_NoddyType); return m; }

source: Now that's quite a bit to take in at once, but hopefully bits will seem familiar from the last chapter.
pl: To całkiem sporo aby strawić, jak na jeden raz, ale miejmy nadzieję że niektóre fragmenty będą wyglądały znajomo z poprzedniego rozdziału.

source: The first bit that will be new is::
pl: Pierwszy fragment który będzie nowy jest::

source: This is what a Noddy object will contain---in this case, nothing more than every Python object contains, namely a refcount and a pointer to a type object. These are the fields the ``PyObject_HEAD`` macro brings in. The reason for the macro is to standardize the layout and to enable special debugging fields in debug builds. Note that there is no semicolon after the ``PyObject_HEAD`` macro; one is included in the macro definition. Be wary of adding one by accident; it's easy to do from habit, and your compiler might not complain, but someone else's probably will! (On Windows, MSVC is known to call this an error and refuse to compile the code.)
pl: To jest tym co przedmiot Noddy będzie zawierał --- w tym przypadku, nic więcej poza tym co każdy przedmiot języka pytonowskiego posiada, to jest liczba odniesień i wskaźnik do przedmiotu reprezentującego typ przedmiotu. To są pola które makropolecenie ``PyObject_HEAD`` wprowadza. Powodem makropolecenia jest standaryzacja rozkładu i umożliwienie szczególnych pól dla odpluskwiania w budowach odpluskwiających. Zauważ, że nie ma średnika po makropoleceniu ``PyObject_HEAD``; jeden jest zawarty w definicji makropolecenia. Uważaj też na dodanie jednego przez przypadek; łatwo się pomylić przez nawyk a kompilator nie będzie protestował ale ktoś inny prawdopodobnie będzie! (W Windows, MSVC jest znany z nazywania tego błędem i odmawiania kompilacji kodu.)

source: For contrast, let's take a look at the corresponding definition for standard Python floats::
pl: Dla skontrastowania, zobaczmy odpowiadającą definicję standardowych liczb zmiennoprzecinkowych języka pytonowskiego::

source: Moving on, we come to the crunch --- the type object. ::
pl: Idąc dalej, dochodzimy do skurczu --- przedmiotu typu. ::

source: static PyTypeObject noddy_NoddyType = { PyVarObject_HEAD_INIT(NULL, 0) "noddy.Noddy", /* tp_name */ sizeof(noddy_NoddyObject), /* tp_basicsize */ 0, /* tp_itemsize */ 0, /* tp_dealloc */ 0, /* tp_print */ 0, /* tp_getattr */ 0, /* tp_setattr */ 0, /* tp_reserved */ 0, /* tp_repr */ 0, /* tp_as_number */ 0, /* tp_as_sequence */ 0, /* tp_as_mapping */ 0, /* tp_hash */ 0, /* tp_call */ 0, /* tp_str */ 0, /* tp_getattro */ 0, /* tp_setattro */ 0, /* tp_as_buffer */ Py_TPFLAGS_DEFAULT, /* tp_flags */ "Noddy objects", /* tp_doc */ };
pl: static PyTypeObject noddy_NoddyType = { PyVarObject_HEAD_INIT(NULL, 0) "noddy.Noddy", /* tp_name */ sizeof(noddy_NoddyObject), /* tp_basicsize */ 0, /* tp_itemsize */ 0, /* tp_dealloc */ 0, /* tp_print */ 0, /* tp_getattr */ 0, /* tp_setattr */ 0, /* tp_reserved */ 0, /* tp_repr */ 0, /* tp_as_number */ 0, /* tp_as_sequence */ 0, /* tp_as_mapping */ 0, /* tp_hash */ 0, /* tp_call */ 0, /* tp_str */ 0, /* tp_getattro */ 0, /* tp_setattro */ 0, /* tp_as_buffer */ Py_TPFLAGS_DEFAULT, /* tp_flags */ "Przedmioty Noddy", /* tp_doc */ };

source: Now if you go and look up the definition of :ctype:`PyTypeObject` in :file:`object.h` you'll see that it has many more fields that the definition above. The remaining fields will be filled with zeros by the C compiler, and it's common practice to not specify them explicitly unless you need them.
pl: Teraz jeśli pójdziesz i sprawdzisz definicję :ctype:`PyTypeObject` w pliku :file:`object.h` zobaczysz że ma ona dużo więcej pól niż powyższa definicja. Pozostałe pola będą wypełnione zerami przez kompilator języka C, i jest to częstą praktyką nie określać ich jawnie chyba że się ich potrzebuje.

source: This is so important that we're going to pick the top of it apart still further::
pl: To jest tak istotne że mamy zamiar rozebrać na części górę tego jeszcze bardziej::

source: This line is a bit of a wart; what we'd like to write is::
pl: Ta linia jest nieco jak pryszcz; to co chcielibyśmy napisać to::

source: as the type of a type object is "type", but this isn't strictly conforming C and some compilers complain. Fortunately, this member will be filled in for us by :cfunc:`PyType_Ready`. ::
pl: jako że typ przedmiotu typu jest "typem" ale to nie jest ściśle stosowanie się do C i niektóre kompilatory będą narzekać. Szczęśliwie ten członek będzie wypełniony dla nas przez :cfunc:`PyType_Ready`.::

source: The name of our type. This will appear in the default textual representation of our objects and in some error messages, for example::
pl: Nazwa naszego typu. To pojawi się w domyślnej tekstowej reprezentacji naszego przedmiotu i w niektórych wiadomościach o błędzie, na przykład::

source: >>> "" + noddy.new_noddy() Traceback (most recent call last): File "<stdin>", line 1, in ? TypeError: cannot add type "noddy.Noddy" to string
pl: >>> "" + noddy.new_noddy() Wypis śledzenia (najbardziej niedawne wywołanie ostatnie): File "<stdin>", line 1, in ? Błąd Typu: nie można dodać typu "noddy.Noddy" do ciągu znaków

source: Note that the name is a dotted name that includes both the module name and the name of the type within the module. The module in this case is :mod:`noddy` and the type is :class:`Noddy`, so we set the type name to :class:`noddy.Noddy`. ::
pl: Zauważ, że nazwa jest nazwą po kropce która zawiera zarówno nazwę modułu i nazwę typu wewnątrz modułu. Modułem w tym przypadku jest :mod:`noddy` i typem jest :class:`Noddy`, więc ustawiamy nazwę typu uogólnienia na :class:`noddy.Noddy`. ::

source: This is so that Python knows how much memory to allocate when you call :cfunc:`PyObject_New`.
pl: To tak, aby język pytonowski wiedział jak dużo pamięci przydzielić gdy wywoływane jest zadanie :cfunc:`PyObject_New`.

source: If you want your type to be subclassable from Python, and your type has the same :attr:`tp_basicsize` as its base type, you may have problems with multiple inheritance. A Python subclass of your type will have to list your type first in its :attr:`__bases__`, or else it will not be able to call your type's :meth:`__new__` method without getting an error. You can avoid this problem by ensuring that your type has a larger value for :attr:`tp_basicsize` than its base type does. Most of the time, this will be true anyway, because either your base type will be :class:`object`, or else you will be adding data members to your base type, and therefore increasing its size.
pl: Jeśli chcesz aby twój typ uogólnienia był możliwy do wyciągnięcia uogólnienia pochodnego w języku pytonowskim, i twój typ ma ten sam :attr:`tp_basicsize` jako jego typ bazowy, możesz mieć problemy z wielokrotnym dziedziczeniem. Podrzędne uogólnienie twojego typu będzie musiało wypisać twój typ na początku w swojej listy :attr:`__bases__`, bo w przeciwnym razie nie będzie w stanie wywołać sposobu postępowania :meth:`__new__` należącego do twojego typu bez spowodowania błędu. Można uniknąć tego problemu przez zapewnienie, że twój typ ma większą wartość dla :attr:`tp_basicsize` niż jego typ bazowy. W większości przypadków będzie to prawdą tak czy inaczej, gdyż albo twoje uogólnienie bazowe będzie uogólnieniem :class:`object`, lub w przeciwnym wypadku będziesz dodawał członki danych do typu bazowego, i w ten sposób zwiększał jego rozmiar.

source: This has to do with variable length objects like lists and strings. Ignore this for now.
pl: To ma do czynienia ze zmienną długością przedmiotów takich jak listy i ciągi znaków. Pomińmy to na razie.

source: Skipping a number of type methods that we don't provide, we set the class flags to :const:`Py_TPFLAGS_DEFAULT`. ::
pl: Pomijając pewną liczbę sposobów postępowania należących do typu których nie dostarczamy, ustawiamy flagi uogólnienia na :const:`Py_TPFLAGS_DEFAULT`. ::

source: All types should include this constant in their flags. It enables all of the members defined by the current version of Python.
pl: Wszystkie typy powinny zawierać tą stałą w swoich flagach. Ona włącza wszystkie członki określone przez obecną wersję języka pytonowskiego.

source: We provide a doc string for the type in :attr:`tp_doc`. ::
pl: Dostarczamy ciąg znaków dokumentacji dla tego typu uogólnienia w :attr:`tp_doc`. ::

source: "Noddy objects", /* tp_doc */
pl: "Przedmioty Noddy", /* tp_doc */

source: Now we get into the type methods, the things that make your objects different from the others. We aren't going to implement any of these in this version of the module. We'll expand this example later to have more interesting behavior.
pl: Teraz zabierzemy się za sposoby postępowania rodzaju uogólnienia, rzeczy które sprawiają że twoje przedmioty są wyjątkowe na tle pozostałych. Nie wypełnimy żadnej z tych w tej wersji modułu. Rozszerzymy ten przykład później aby mieć bardziej interesujące zachowanie.

source: For now, all we want to be able to do is to create new :class:`Noddy` objects. To enable object creation, we have to provide a :attr:`tp_new` implementation. In this case, we can just use the default implementation provided by the API function :cfunc:`PyType_GenericNew`. We'd like to just assign this to the :attr:`tp_new` slot, but we can't, for portability sake, On some platforms or compilers, we can't statically initialize a structure member with a function defined in another C module, so, instead, we'll assign the :attr:`tp_new` slot in the module initialization function just before calling :cfunc:`PyType_Ready`::
pl: Na razie, wszystko czego chcemy, to mieć możliwość tworzyć nowe przedmioty uogólnienia :class:`Noddy`. Aby umożliwić tworzenie przedmiotów, musimy dostarczyć wypełnienie sposobu postępowania dla :attr:`tp_new`. W tym przypadku możemy po prostu użyć domyślnego wypełnienia dostarczonego przez zadanie sprzęgu programowania aplikacji :cfunc:`PyType_GenericNew`. Wolelibyśmy po prostu przypisać to do gniazda :attr:`tp_new`, ale nie możemy, z powodu umożliwienia przenośności, Na niektórych maszynach/środowiskach lub kompilatorach, nie możemy statycznie inicjować członka struktury z zadaniem zdefiniowanym w innym module C, więc, zamiast tego, przypiszemy gniazdo :attr:`tp_new` w zadaniu inicjującym moduł tuż przed wywołaniem :cfunc:`PyType_Ready`::

source: All the other type methods are *NULL*, so we'll go over them later --- that's for a later section!
pl: Wszystkie inne sposoby postępowania są *NULL*, więc przyjrzymy się im później --- to jest dla późniejszej sekcji!

source: Everything else in the file should be familiar, except for some code in :cfunc:`PyInit_noddy`::
pl: Wszystko inne w pliku powinno być znajome, z wyjątkiem pewnych kodów w :cfunc:`PyInit_noddy`::

source: This initializes the :class:`Noddy` type, filing in a number of members, including :attr:`ob_type` that we initially set to *NULL*. ::
pl: To inicjuje typ :class:`Noddy`, wypełniając pewną liczbę członków, zawierającą :attr:`ob_type` które początkowo ustawiamy na *NULL*. ::

source: This adds the type to the module dictionary. This allows us to create :class:`Noddy` instances by calling the :class:`Noddy` class::
pl: To dodaje typ do słownika modułu. To pozwala nam tworzyć przykłady uogólnienia :class:`Noddy` przez odwołanie się do uogólnienia :class:`Noddy` ::
